app/controllers/invoices_controller.rb

SELECT * FROM "invoices" LIMIT 1
---
  def index
    @invoices = Invoice.all

SELECT * FROM "invoices" WHERE ("invoices"."id" = 1)
SELECT * FROM "tipo_ivas" WHERE ("tipo_ivas"."id" = 1)
---
  def show
    @invoice = Invoice.find(params[:id])
	#@tot_imponibile = @invoice.jobs.map{|x| x.importo * x.qty}.inject(0){|sum,item| sum + item}
	#@totale = @invoice.jobs.map{|x| (x.importo * x.qty) + (x.importo * x.qty * x.tipo_iva.aliquota / 100)}.inject(0){|sum,item| sum + item}

	@tot_imponibile = @invoice.jobs.map{|x| x.importo}.inject(0){|sum,item| sum + item}
	@totale = @invoice.jobs.map{|x| (x.importo) + (x.importo * x.tipo_iva.aliquota / 100)}.inject(0){|sum,item| sum + item}

SELECT * FROM "invoices" WHERE ("invoices"."id" = 1)
---
  def edit
    @invoice = Invoice.find(params[:id])

INSERT INTO "invoices" ("data_fattura", "created_at", "updated_at", "descrizione", "customer_id", "codice") VALUES('2010-01-07', '2010-01-07 15:17:57', '2010-01-07 15:17:57', 'seconda fattura', 1, '2010-01-2')
---
  def create
    @invoice = Invoice.new(params[:invoice])

    respond_to do |format|
      if @invoice.save

SELECT * FROM "invoices" WHERE ("invoices"."id" = 3)
UPDATE "invoices" SET "updated_at" = '2010-01-07 15:52:44', "descrizione" = 'Fattura in euro per tony smith' WHERE "id" = 3
---
  def update
    @invoice = Invoice.find(params[:id])

    respond_to do |format|
      if @invoice.update_attributes(params[:invoice])

SELECT * FROM "invoices" WHERE ("invoices"."id" = 1)
DELETE FROM "invoices" WHERE "id" = 1
---
  def destroy
    @invoice = Invoice.find(params[:id])
    @invoice.destroy

SELECT * FROM "invoices" WHERE ("invoices"."id" = 3)
SELECT * FROM "tipo_ivas" WHERE ("tipo_ivas"."id" = 1)
---
  def print

	  @invoice = Invoice.find(params[:id])
	  @tot_imponibile = @invoice.jobs.map{|x| x.importo}.inject(0){|sum,item| sum + item}
	@totale = @invoice.jobs.map{|x| (x.importo) + (x.importo * x.tipo_iva.aliquota / 100)}.inject(0){|sum,item| sum + item}