app/controllers/jobs_controller.rb

  def new
    @job = Job.new
	@invoice = Invoice.find(params[:invoice])
---
SELECT * FROM "invoices" WHERE ("invoices"."id" = 3)