app/controllers/tipo_ivas_controller.rb

SELECT * FROM "tipo_ivas"
---
  def index
    @tipo_ivas = TipoIva.all

SELECT * FROM "tipo_ivas" WHERE ("tipo_ivas"."id" = 1)
---
  def show
    @tipo_iva = TipoIva.find(params[:id])

SELECT * FROM "tipo_ivas" WHERE ("tipo_ivas"."id" = 2)
---
  def edit
    @tipo_iva = TipoIva.find(params[:id])

INSERT INTO "tipo_ivas" ("created_at", "updated_at", "descrizione", "aliquota") VALUES('2010-01-11 14:09:28', '2010-01-11 14:09:28', '', 34)
---
  def create
    @tipo_iva = TipoIva.new(params[:tipo_iva])

    respond_to do |format|
      if @tipo_iva.save

SELECT * FROM "tipo_ivas" WHERE ("tipo_ivas"."id" = 2)
UPDATE "tipo_ivas" SET "updated_at" = '2010-01-14 16:21:10', "descrizione" = 'Nuova aliquota' WHERE "id" = 2
---
  def update
    @tipo_iva = TipoIva.find(params[:id])

    respond_to do |format|
      if @tipo_iva.update_attributes(params[:tipo_iva])